--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]

HelpListUtilNow = [[
<b>》لیست راهنمای ربات :</b>

》➢- راهنمای قفل ها#
مربوط به قفل های بات ، دریافت تنظیمات و ...

》➢- راهنمای فیلتر#
مربوط به فیلتر کلمات ، دریافت لیست فیلتر و ...

》➢- راهنمای اطلاعات#
مربوط به دریافت اطلاعات کاملی از خود ، گروه و ...

》>برای دریافت هر آموزش عبارت آن را تایپ کنید .
برای مثال# :
(راهنمای قفل ها)
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄
〉〉〉 @NationalTM 〈〈〈
]]
---------------------------------------

-- راهنمای قفل ها
LocksHelp = [[
<b>》 راهنمای قفل های بات </b>
﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃﹄﹃
<b> 🔐 قفل های اصلی </b>
<b>➢ جلوگیری از ارسال لینک :</b>
❌ قفل لینک
✅ بازکردن لینک
》<b>قفل فروارد :</b>
❌ قفل فروارد
✅ بازکردن فروارد

》<b> حذف کیبورد (دکمه) های شیشه ای :</b>
❌ قفل کیبورد
✅ بازکردن کیبورد

》<b> پاسخ ندادن بات به کاربران عادی در گروه :</b>
❌ قفل دستورات
✅ بازکردن دستورات

》<b> حذف پیام های انگلیسی :</b>
❌ قفل انگلیسی
✅ بازکردن انگلیسی

》 <b>حذف پیام های فارسی و عربی :</b>
❌ قفل فارسی
✅ بازکردن فارسی

》 <b>حذف پیام های طولانی :</b>
❌ قفل اسپم
✅ بازکردن اسپم

》 <b>اخراج کاربری که در گروه پیام رگباری ارسال کند :</b>
❌ قفل رگباری
✅ بازکردن رگباری

》 <b>تنظیم حساسیت پیام های رگباری (مکرر) :</b>
❌ تنظیم اسپم 7
» به جای 7 میتوانید اعداد 5 تا 20 را قرار دهید.

》<b> اخراج ربات هایی که وارد گروه میشوند :</b>
❌ قفل ربات
✅ بازکردن ربات

》<b> حذف پیام ورود و خروج کاربران از گروه :</b>
❌ قفل خدمات
✅ بازکردن خدمات
━━━━━━━━━━ 
<b>➢ قفل های رسانه ای</b>

<b>》حذف صدا و ویس ارسالی در گروه :</b>
✅ قفل صدا
❌ بازکردن صدا

<b>》 حدف تصاویر ارسالی :</b>
✅ قفل عکس
❌ بازکردن عکس

<b>》 حذف ویدیو ارسالی :</b>
✅ قفل ویدیو
❌ بازکردن ویدیو

<b>》 حذف فایل های ارسالی :</b>
✅ قفل فایل
❌ بازکردن فایل

<b>》 حذف متنی که به تنهایی ارسال میشود :</b>
✅ قفل متن
❌ بازکردن متن

<b>》 حذف گیف (عکس متحرک) ارسالی :</b>
✅ قفل گیف
❌ بازکردن گیف

<b>》 حذف استیکر های ارسالی :</b>
✅ قفل استیکر
❌ بازکردن استیکر

<b>》 قفل ارسال مخاطب (Share Contact) :</b>
✅ قفل مخاطب
❌ بازکردن مخاطب
━━━━━━━━━━ 
<b> ➢ قفل های مهم </b>

<b>》 اخراج کاربری که در گروه لینکی ارسال کند :</b>
✅ قفل سخت
❌ بازکردن سخت

<b>》 حذف تمامی پیام های ارسالی در گروه (بستن چت) :</b>
✅ قفل چت
❌ بازکردن چت

<b>》 نمایش تنظیمات گروه :</b>
💠 تنظیمات
━━━━━━━━━━━━
    🔱 [ @NationalTM] 🔱
     » [ @Mr_Develloper ] «
]]

FilterHelp = [[
<b> ➢ آموزش فیلتر کلمات :</b>

<b>》با فیلتر کردن یک کلمه ، بات در صورت مشاهده ی اون کلمه در یک متن ، اون متن رو حذف خواهد کرد.</b>
 دستورات قسمت فیلتر :

<b>》 فیلتر کردن یک کلمه</b>
{فیلتر {عبارت مورد نظر

<b>》 رفع فیلتر یک کلمه :</b>
{رفع فیلتر {عبارت مورد نظر

<b>》 دریافت لیست کلمات فیلتر شده :</b>
لیست فیلتر

<b>》 حذف کل کلمات فیلتر شده :</b>
پاکسازی لیست فیلتر

<b>》مثال فیلتر کردن یک کلمه :</b>
فیلتر احمق
» در اینجا عبارت "احمق" فیلتر خواهد شد.

<b>》مثال رفع فیلتر یک کلمه :</b>
رفع فیلتر احمق
» در این قسمت عبارت "احمق" رفع فیلتر خواهد شد.
ـــــــــــــــــــــــــــــــــــــــــ
    🔱 [ @NationalTM ] 🔱
     » [ @Mr_Develloper ] «
]]


GroupInformationHelp = [[
<b>➢ راهنمای دریافت اطلاعات :</b>

<b>》 دستور دریافت اطلاعات کلی درباره ی خود :</b>
اطلاعات

<b>》 دستور دریافت اطلاعات کلی گروه :</b>
اطلاعات گروه

<b>》 دستور دریافت لیست ادمین های گروه :</b>
ادمین ها

<b>》 دستور دریافت لیست مدیران فرعی بات در گروه </b>:
مدیران فرعی

<b>》 دستور دریافت لیست بات های API موجود در گروه :</b>
ربات ها

<b>》 دستور دریافت آیدی مدیر اصلی بات در گروه :</b>
مدیر اصلی

<b>➢  کار با لینک در گروه :</b>

<b>》دستور تنظیم لینک در گروه :</b>
تنظیم لینک

<b>》دستور دریافت لینک گروه :</b>
لینک
ـــــــــــــــــــــــــــــــــــــــــــ
    🔱 [ @NationalTM ] 🔱
     » [ @Mr_Develloper ] «
]]


local function run(msg,matches)

	------- LOCK CMD
	data = load_data(_config.moderation.data)
	if data[tostring(msg.to.id)] then
		if data[tostring(msg.to.id)]['settings'] then
			if data[tostring(msg.to.id)]['settings']['lock_cmd'] then
				lock_cmd = data[tostring(msg.to.id)]['settings']['lock_cmd']
				if lock_cmd == "yes" and not is_momod(msg) then
					return
				end
			end
		end
	end
	-------
	
	if matches[1] == "راهنما" then
		return reply_msg(msg.id,HelpListUtilNow,ok_cb,false)
	end
	
	if matches[1] == "راهنمای" and matches[2] then
		
		if matches[2] == "قفل ها" then
			return reply_msg(msg.id,LocksHelp,ok_cb,false)
		end
		
		if matches[2] == "فیلتر" then
			return reply_msg(msg.id,FilterHelp,ok_cb,false)
		end
		
		if matches[2] == "اطلاعات" then
			return reply_msg(msg.id,GroupInformationHelp,ok_cb,false)
		end
		
	end -- end matches[1] == "راهنمای"

end	

return {
patterns = {
	"^(راهنما)$",
	"^(راهنمای) (.*)"
},
	run = run
}

--[[

	Powered By :
		 _____       _  ____
		| ____|_ __ (_)/ ___|_ __ ___   __ _ TM
		|  _| | '_ \| | |  _| '_ ` _ \ / _` |
		| |___| | | | | |_| | | | | | | (_| |
		|_____|_| |_|_|\____|_| |_| |_|\__,_|
	
	****************************
	*  >> By : Reza Mehdipour  *
	*  > Channel : @EnigmaTM   *
	****************************
	
]]
